
//////////////////////////////////////////////////////////////////////////////
//u8 HC595_CS1;    //STcp	////锁存时钟-----74HC595 12# 
//u8 HC595_CLK;   //SHcp   ////移位时钟-----74HC595 11# 
//u8 HC595_DAT;   //Ds     ////数据---------74HC595 14# 
//
//u8 HC595_CS2;    //STcp	////锁存时钟-----74HC595 12# 
//u8 HC595_CLK2;   //SHcp   ////移位时钟-----74HC595 11# 
//IO操作函数
////双排
//#define HC595_CS1    PDout(8)   //STcp	////锁存时钟-----74HC595 12# 	 ///板上网络RS
//#define HC595_CLK1   PDout(12)   //SHcp   ////移位时钟-----74HC595 11# 	 //板上网络CS2
//#define HC595_DAT    PDout(1)             //Ds     ////数据---------74HC595 14# STC12C5A16S2	//板上网络PD1
//
//#define HC595_CS2    PDout(9)             //STcp	////锁存时钟-----74HC595 12#   //板上网络RW
//#define HC595_CLK2   PDout(3)  //SHcp   ////移位时钟-----74HC595 11# //板上网络PD3

//单排
#include "delay.h"
#define HC595_CS1    PDout(0)
#define HC595_CLK1   PDout(4) 
#define HC595_DAT    PDout(13)
#define HC595_CS2    PDout(9)
#define HC595_CLK2   PDout(11)

//////////////////////////////////////////////////////////////////////////

u8  DB[]={0x3f, 0x06, 0x5b, 0x4f, 0x66, 0x6d, 0x7d, 0x07, 0x7f, 0x6f, 0x77, 0x7c, 0x39, 0x5e, 0x79, 0x71}; //0~9数据

void HC595_Sendu8(u8 *dat, u8 sw);
/**************************************
向HC595发送一个字节数据
因为增加了HC595，所以信号相反
**************************************/
void HC595_Sendu8(u8 *dat, u8 sw)
{
    u8 i,j;
	u8 temp;
	u8 temp1;
    HC595_CS1=0;
	HC595_CLK1 = 0;			  ////////////////////////////////////////////////////////////////////////////////////////////////////////	*/
	HC595_CS2=0;
	HC595_CLK2 = 0;  
	uDelay(5);             //延时
	for(j=0;j<5;j++)
	{
		temp=dat[j];
		for (i=0; i<8; i++)         //8位计数器
	    {
	       temp1=temp;
	       if(temp1&0x80)HC595_DAT = 1;          //送数据口       //先发最高位
	        else HC595_DAT = 0;  
			 temp<<=1; 
			if(sw==0)
	       	 	HC595_CLK1 = 1;          //拉高时钟线	 *///////////////////////////////////////////////////////////////////////
			else
				HC595_CLK2 = 1;          //拉高时钟线  *//////////////////////////////////////////////////////////////////////////////////////
	        uDelay(5);              //延时
	        HC595_CLK1 = 0;          //拉低时钟线	 *////////////////////////////////////////////////////////////////////
			HC595_CLK2 = 0;          //拉低时钟线
	        uDelay(5);              //延时
	    }
	}
	if(sw==0)
		HC595_CS1=1;
	else
		HC595_CS2=1;
	uDelay(5);              //延时
	HC595_CS1=0;
	HC595_CS2=0;
}


vu8 DPY_data[5];
//数码管显示函数
void DPYdisplay(u16 dis,u8 dl)
{ 
	u8 num[5];
	num[4]=dis/10000;     //得到要显示数据的万位
	num[3]=(dis%10000)/1000;     //得到要显示数据的千位
	num[2]=(dis%1000)/100;       //得到要显示数据的百位
	num[1]=(dis%100)/10;         //得到要显示数据的十位
	num[0]=(dis%10);             //得到要显示数据的个位
	DPY_data[4]=DB[num[4]];
	DPY_data[3]=DB[num[3]];
	DPY_data[2]=DB[num[2]];
	DPY_data[1]=DB[num[1]];
	DPY_data[0]=DB[num[0]];
	if(num[4]==0)
	{
	 	DPY_data[4]=0;
		if(num[3]==0)
		{
		 	DPY_data[3]=0;
			if(num[2]==0)
			{
			 	DPY_data[2]=0;
				if(num[1]==0)
				{
				 	DPY_data[1]=0;
				}
			}
		}
	}
	HC595_Sendu8(DPY_data,dl);
}
